tutorials/multicomponentFluid/DLR_A_LTS/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultValues
{
    T   292;
}

zones
{
    burnt
    {
        type        box;

        box         (0.002 -0.01 0.005) (0.02 0.01 0.055);

        values
        {
            T   2200;
        }
    }
}

// ************************************************************************* //
